loadtest.yml
config:
  target: "ws://ws.ankarapointhotel.com:6001/app/123?protocol=7&client=js&version=7.0.3&flash=false"
  phases:
    - duration: 120 # Test for 60 seconds
      arrivalRate: 10 # Every second, add 10 users
      rampTo: 500 # And ramp it up to 100 users in total over the 60s period
      name: "Ramping up the load"
    - duration: 240 # Then resume the load test for 120s
      arrivalRate: 10 # With those 100 users we ramped up to in the first phase
      rampTo: 500 # And keep it steady at 100 users
      name: "Pushing a constant load"
scenarios:
  - engine: "ws"
    flow:
      - send: '{"event":"pusher:subscribe","data":{"channel":"store.515"}}' # Subscribe to the public channel
      - think: 15 # Every connection will remain open for 15s
      - send: '{ "event": "task.created", "channel": "store.515", "data": "cenas" }
'